src/ПодсистемаPAPI/Enums/PAPI_ТипЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PAPI_ТипЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Примечание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/CommonModules/PAPI_Логирование/Ext/Module.bsl
#Область License

//MIT License

//Copyright (c) 2024-2026 Dmitrii Sidorenko

//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:

//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.

//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Записать в журнал регистрации
//
// Параметры:
//  ИмяСобытия		- Строка - Пример: "ИнформационнаяБаза.ОбновлениеИБ"
//	ТекстОшибки		- Строка - Текст ошибки 
//  УровеньВажности - Строка, 
//					  ПеречислениеСсылка.PAPI_ТипЛога, 
//					  УровеньЖурналаРегистрации - Уровень важности события. Пример: УровеньЖурналаРегистрации.Информация
//	ДанныеСобытия	- ЛюбаяСсылка, 
//					  Число, 
//					  Строка, 
//					  Дата, 
//					  Булево - Данные, с которыми связано событие
//
Процедура ЗаписатьВЛог(ИмяСобытия = "PAPI", УровеньВажности, ТекстОшибки, ДанныеСобытия = Неопределено) Экспорт 

	Если Не ЗначениеЗаполнено(ИмяСобытия) Тогда 
		ИмяСобытия = "PAPI";	
	КонецЕсли;	
	
	Если СтрНайти(ВРег(ИмяСобытия), "PAPI") = 0 Тогда
	    ИмяСобытия = "PAPI." + ИмяСобытия;
	КонецЕсли;   
	
	перУровеньВажности = ПолучитьУровеньЖурналаРегистрации(УровеньВажности);
	
	ЗаписьВЖурналРегистрацииБезОбъектаИМетаданных(ИмяСобытия, перУровеньВажности, ТекстОшибки, ДанныеСобытия);
	
КонецПроцедуры

#Область РаботаСЖурналомРегистрации

// Запись в журнал регистрации без объекта и метаданных
//
// Параметры:
//	ИмяСобытия 		- Строка - Пример: "ИнформационнаяБаза.ОбновлениеИБ"
//  УровеньВажности - УровеньЖурналаРегистрации - Уровень важности события. Пример: УровеньЖурналаРегистрации.Информация
//	ТекстОшибки		- Строка - Текст ошибки
//	ДанныеСобытия	-   ЛюбаяСсылка, 
//						Число, 
//						Строка, 
//						Дата, 
//						Булево - Данные, с которыми связано событие
//   
Процедура ЗаписьВЖурналРегистрацииБезОбъектаИМетаданных(ИмяСобытия, УровеньВажности, ТекстОшибки, ДанныеСобытия = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ДанныеСобытия) Тогда 
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньВажности,, ДанныеСобытия, ТекстОшибки); 
		
	Иначе 

		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньВажности,,, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры	

// Запись в журнал регистрации без объекта и метаданных
//
// Параметры:
//	ИмяСобытия 		-   Строка - Пример: "ИнформационнаяБаза.ОбновлениеИБ"
//	ТекстОшибки		-   Строка - Текст ошибки
//	ДанныеСобытия	-   ЛюбаяСсылка, 
//						Число, 
//						Строка, 
//						Дата, 
//						Булево - Данные, с которыми связано событие
// 
Процедура ЗаписьВЖурналРегистрацииОшибки(ИмяСобытия, ТекстОшибки, ДанныеСобытия = Неопределено) Экспорт  
	
	Если ЗначениеЗаполнено(ДанныеСобытия) Тогда 
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДанныеСобытия, ТекстОшибки); 
		
	Иначе 
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

// Получить уровень журнала регистрации
//
// Параметры:
//  ТипЛога	 -  Строка, 
//				ПеречислениеСсылка.PAPI_ТипЛога, 
//				УровеньЖурналаРегистрации - Тип записи для журнала регистрации
// 
// Возвращаемое значение:
//  УровеньЖурналаРегистрации - Тип записи журнала регистрации (Ошибка, Предупреждение, Примечание, Информация) 
//
Функция ПолучитьУровеньЖурналаРегистрации(Знач ТипЛога = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ТипЛога) Тогда
		
		Возврат УровеньЖурналаРегистрации.Примечание;
		
	КонецЕсли;
	
	Если ТипЗнч(ТипЛога) = Тип("ПеречислениеСсылка.PAPI_ТипЛога") Тогда 
		
		Если ТипЛога = Перечисления.PAPI_ТипЛога.Ошибка Тогда  
			
			Возврат УровеньЖурналаРегистрации.Ошибка;
			
		ИначеЕсли ТипЛога = Перечисления.PAPI_ТипЛога.Предупреждение Тогда 
			
			Возврат УровеньЖурналаРегистрации.Предупреждение; 
			
		ИначеЕсли ТипЛога = Перечисления.PAPI_ТипЛога.Информация Тогда 
			
			Возврат УровеньЖурналаРегистрации.Информация;
			
		Иначе      
			
			Возврат УровеньЖурналаРегистрации.Примечание; 
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТипЛога) = Тип("Строка") Тогда	
		
		Если ВРег(ТипЛога) = ВРег("Ошибка") Тогда   
			
			Возврат УровеньЖурналаРегистрации.Ошибка;  
			
		ИначеЕсли ВРег(ТипЛога) = ВРег("Предупреждение") Тогда  
			
			Возврат УровеньЖурналаРегистрации.Предупреждение;
			
		ИначеЕсли ВРег(ТипЛога) = ВРег("Информация") Тогда
			
			Возврат УровеньЖурналаРегистрации.Информация;
			
		Иначе                                           
			
			Возврат УровеньЖурналаРегистрации.Примечание;   
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТипЛога) = Тип("УровеньЖурналаРегистрации") Тогда 	
		
		Возврат ТипЛога; 
		
	Иначе
		
		Возврат УровеньЖурналаРегистрации.Примечание;
		
	КонецЕсли;	
				
КонецФункции	
	
#КонецОбласти
